** oxonbot.scm
This file contains all of the bot's functions.

It can be used from command line, without the server:
#+BEGIN_SRC bash
  guile oxonbot.scm roll 100
#+END_SRC

#+RESULTS:
jakub-w rolled: 33, SUM: 33

Currently there are a few commands:
- roll :: Generate a random number.
- quote :: Add or display a random quote.

Usage rules of the commands can be obtained by invoking them without any arguments (e.g. ~guile oxonbot.scm roll~).
